examples/flows/compiled/mutations_with_handler/flow.mmd
flowchart TD
    %% Flow: mutations_with_handler

    handler_process[handler_process]
    router_mutations_with_handler_flow_line_13_seq_2{{"router_mutations_with_handler_flow_line_13_seq_2<br/><br/>p['initialized'] = True<br/>p['step'] = 1<br/>p['count'] = 0"}}
    router_mutations_with_handler_flow_line_17_seq_1{{"router_mutations_with_handler_flow_line_17_seq_1<br/><br/>p['finalized'] = True"}}
    start_mutations_with_handler_flow([start_mutations_with_handler_flow])
    __end__((( )))

    start_mutations_with_handler_flow --> router_mutations_with_handler_flow_line_13_seq_2
    router_mutations_with_handler_flow_line_13_seq_2 --> handler_process
    handler_process --> router_mutations_with_handler_flow_line_17_seq_1
    router_mutations_with_handler_flow_line_17_seq_1 --> __end__
